{
  "text": "Stitaprajna Panda +919348974008 |  stitaprajna.panda@gmail.com |  Stitaprajna |  stitaprajna-panda-b671b4236/\nResearch Interests\nScientific Computing, Computational Physics, Computer Vision, Natural Language Processing , Statistics, Deep Leaning, Machine\nLearning, Data Science, Theoretical Physics, Qunatum Mechanics.\nEducation\nIndian Institute of Technology (IIT), Kanpur Kanpur, India\nM.SC.(DUAL) iN PHYSiCS Aug. 2018 ‑ Jun. 2021\n• CPI: 7.48/10.0\nPondicherry University (PU) Puducherry, India\nB.SC. iN PHYSiCS July. 2015 ‑ June. 2018\n• CGPA: 8.46/10.0\nComputation skills\nProgramming Languages Python, Java, JavaScript, Typescript, MySQL, Git, HTML, CSS\nML Models and Libreries Yolo, BERT, GPT, LangChain, Stable Diffusion, ESRGAN, T5, Scikit, Numpy, Matplotlib, Pandas, PyTorch, TensorFlow, GFPGAN\nDeployment Frameworks AWS EC2, AWS S3, Docker, Airflow, Flyte\nDashboard Frameworks Graphana, Kibana, Dash, PowerBI, Tableau, Excel, Zira\nEngineering skills Data Structure, Algorithms, Database, OOPs, ML, NLP, DL, Computer Vision, Terminal Commands, Object Detection\nLab experience\nMSc. Lab setups Kleystron, Gunn Diode, XRD, Hall probe, Zeeman Effect, 𝛽‑ray spectroscopy, Faraday rotation, Phase transition, Michelson‑Interferometer,\nElectro‑optic effect, photoconductivity, Concave grating & spectrometer.\nElectronics Lab Intel 8051 Microcontroller, Seven segment display (SSD), Shift registers, Op‑amp, transistors.\nExperience\nNearBuzz, Hyderabad Hyderabad, India\nSOFTWARE ENGiNEER (AI & FULL STACK) Oct. 2023 ‑ Mar. 2024\n• Contributing to a client project related to an Ed‑tech company, by building the Frontend Web Application.\n• Built a POC for a Chat AI service, using Langchain, RAG, and OpenAI models.\nAlectio India, Hyderabad Remote\nML RESEARCHER/SCiENTiST Feb. 2023 ‑ Jun. 2023\n• Developed & implemented a modified Expected Model Change(Active Learning algorithm) for Machine Translation, reduced the training data to 33%.\n• Created a Fast Fourier Transform based Query Strategy that removes the corrupted data from image dataset.\n• Pioneered a research work on developing a ‘Phase‑based’ Query Strategy for applying Active Learning to Time‑series.\n• Implemented and productionized Greedy Sampling (Active Learning algorithm) for Regression.\n• Added support for the FLYTE orchestration workflow for the Regression projects.\nUpwork Remote\nFREELANCE DATA SCiENTiST Jan. 2023 ‑ Feb. 2023\n• Completed a contract on Automating the Time‑Series Forecasting for Logistics in Power Bi. Designed a Auto‑Training pipeline using task scheduler and\nbrought the ‘MAPE’ under 5% for predictions of revenue over 100 days. Worked with models like TFT & N‑Beats.\nDigite Inc., Bengaluru Remote\nDATA SCiENCE INTERN Sept. 2022 ‑ Jan. 2023\n• Hand‑Engineered a motion based CV algorithm that detects humans motion in a range of 60m, reduces both FP & FN from the actual model’s output.\n• Built an Object Detection model & automated the hand drawn Agile‑Board SwiftKanban.\n• Custom Trained the Detectron2 using ResNext‑101 object detection model, and improved the recall by 20%.\n• Re‑built the analytics dashboard by adding Churn Analysis for Digite’s Kairon platform based on user experience.\nChattel Technologies Private Limited, Bengaluru Remote\nPYTHON DEVELOPMENT INTERN Jul. 2022 ‑ Sept. 2022\n• Web Scrapped the Option‑Chain data from NSE website & ran it on VM (PuTTy/MobaXterm) through AWS EC2.\n• Tested the ‘Trading’ code scripted in Python, and employed ‘Backtesting’ code to obtain the best parameters.\n• Improved the F1‑score of Inception v3 Stock‑Market model by 60% and deployed it using FastAPI and cloud.\nProjects & Research Work\nAdvanced Traffic Management System Vizag, India \nPERSONAL PROJECT (KAGGLE DATASET) Aug. 2023 ‑ Oct. 2023\n• Constructed the Speed Tracking Regions and estimated the distance between each of them.\n• Used YOLOv8 along with Deep SORT to track the vehicles from a fixed camera view point and calculated the Time Elapsed between consecutive regions.\n• Based on the vehicle tracking and time elapsed, calculated the Average Speed of each vehicle , & displayed the number of vehicles detected.\n• Comparing the real‑time speed of vehicle and the speed‑limit (80 km/hr), identified the vehicles exceeding the speed‑limit.\n• Custom trained YOLOv8 and detected the other Traffic violations like people not wearing helmet, seat belt and using phone while driving.\nLinear evolution of the Universe with Dark Matter Kanpur, India\nM.SC. RESEARCH PROJECT II Jan. 2021 ‑ May. 2021\n• Plotted the Density Fluctuation for a matter‑dominated universe, with and without Dark matter.\n• Plotted the Density Fluctuation for a radiation‑dominated universe.\nRenormalization group equation in Particle Physics Kanpur, India\nCOURSE PROJECT, PARTiCLE PHYSiCS (PHY680A) Jan. 2021 ‑ May. 2021\n• Worked out the Subtraction scheme for the two‑point one‑loop 1PI process.\n• Worked out the Mass & Wavelength Renormalization schemes for the self‑energy diagrams of one‑point one‑loop interaction.\n• Worked out the Callan‑Symanzik Equation and the cut‑off dependent functions.\nEvolution of the Universe with Dark matter having viscosity Kanpur, India\nM.SC. RESEARCH PROJECT I Aug. 2020 ‑ Dec. 2020\n• Implemented the SIDM Halo model to the cosmic fluid.\n• Worked out the Bulk & Shear viscosity coefficients for the cosmic fluid.\n• Found out the modified solution of the Einstein’s equation in GR.\n• Estimated the self‑interaction cross‑section required to explain the accelerated expansion of the universe.\nX‑ray Bursts in Low‑mass Binaries Kanpur, India\nCOURSE PROJECT, HiGH ENERGY ASTROPHYSiCS OF BiNARY STARS (PHY667A) Aug. 2020 ‑ Dec. 2020\n• Made a literature survey on LMXB (Low Mass X‑ray Binaries) & HMXB (High Mass X‑ray Binaries).\n• From the collected data, found out the mass and radius of the source (4U 1728‑34).\nDEPENDENCE OF INPUT POLARISATION ON THE POLARIZATION DISTRIBUTION OBTAINED BY THE\nTIGHT FOCAL LENS Kanpur, India\nM.SC. PROJECT III Jan. 2020 ‑ Jun. 2020\n• Worked out the dependence of the input polarisation on the output polarisation due to a tight focusing lens.\n• Plotted the output intensity and confirmed that the output polarisation of a tight focusing lens is a function of the input polarisation.\nAnisotropy in Uniaxial and Biaxial crystals Kanpur, India\nM.SC. PROJECT II Aug. 2019 ‑ Dec. 2019\n• This basically was a reading project, so I made a literature survey on Uniaxial & Biaxial crystals.\nHYDRODYNAMIC THEORY OF PLASMONS IN CONDENSED MATTER Kanpur, India\nM.SC. PROJECT I Jan. 2019 ‑ May. 2019\n• Worked out the dynamics of the Bulk & Surface Plasmons in for bothe single and two‑component electron gas.\n• Found out the possible wave equation for the Chiral Plasmons.\nComparison of Double slit Interference & Diffraction with different types of sources Puducherry, India\nB.SC.(MiNi) PROJECT Mar.2018 ‑ May.2018\n• Compared the Double‑slit interference and diffraction patterns using:\n(i) point source\n(ii) line source\n(iii) both line & point source\nWorkshops\nQuantum Information & Quantum Technology (QIQT), 2019 Kolkata, India\nSUMMER SCHOOL ON QUANTUM COMPUTiNG, SPONSORED BY iAS, iNSA & NAS June. 2019 ‑ July. 2019\n• The Summer School was held at IISER, Kolkata for about 45 days in which students were from all over India.\n• I had a good exposure to the cutting edge technologies, like Quantum cryptography, Quantum Algorithms, Quantum teleportation, Quantum measurements\netc.\nReflections (2016, 2017 & 2018) Puducherry, India\nDEPARTMENT OF PHYSiCS FEST iN PONDiCHERRY UNiVERSiTY Feb. 2016, 2017 & 2018\n• Participated in Reflections, organised by the Department of Physics, Pondicherry University.\nINSPIRE Internship Camp‑2012 Bhubaneswar, India\nCONDUCTED BY DEPARTMENT OF SCiENCE & TECHNOLOGY (DST), GOVT. OF INDiA Aug. 2012\n• Every year, only among top 1% of the Indian students, of class 10𝑡ℎ are allowed to participate in this camp & I feel lucky that I was a part of it.\n• Got a good chance to learn many things that inspired me for choosing a carrier in science.\nAwards & Achievements\n2018‑ 21 Institute Fellowship, Obtained an Institute fellowship for Dual Degree students, IIT Kanpur. Kanpur, India\n2021 Good score in Gate‑2021, Secured an All India Rank (AIR) of 373 in GATE‑2021, within 2% of the total applicant. India\n2018 IIT‑JAM Top Rank, Secured an All India Rank (AIR)‑102 in IIT‑JAM 2018, within 1% of the total applicant. India\n2015‑18 DST‑Fellowship, Got a DST‑Fellowship for Integrated M.Sc. students, Pondicherry University. Puducherry, India\n2017 Topped the Class, I topped the Dr. Bhowmik’s paper on ‘Classical Optics’ by getting 83/100. Puducherry, India\n2016 Best Performance, Got a SGPA of 9.55/10.0 in 3𝑟𝑑 Sem, which was my best in the university. Puducherry, India\n2016 Topped the Class, I topped in the prof. R Murugan (HOD)’s paper on ‘Themal Physics & Kinetic theory’ by getting 90/100. Puducherry, India\n2015 CET‑2015 Top Rank, Got an AIR‑36 in CET‑2015, conducted by Pondicherry University. India\n2015 CBS‑EST 2015 Top Rank, Got an AIR‑24 in CBS‑EST 2015 (within 3%), conducted by CBS Raipur. India\n2014 Best Physics marks in school, Got 95/100 in Physics, in Class 12𝑡ℎ CBSE exam, which was the highest in my school. Cuttack, India\n2012 Cash Award, Got a cash award of Rs.5000 for securing a CGPA 10.0 in class 10𝑡ℎ CBSE exam, from INSPIRE, Department of\nScience & Technology (DST), Govt. of India. Cuttack, India\n2012 NCSC group project, Our group was selected for the final round of the National Children Science Congress (NCSC‑2012). India\nAdvanced Courses in Masters\nPHY690K QUANTUM DYNAMICS, INFORMATION AND COMPUTATION, Spring 2021\nPHY473A COMPUTATIONAL PHYSICS, Spring 2019\nPHY667A STATISTICAL MECHANICS, Spring 2019\nPHY432A QUANTUM MECHANICS‑II, Spring 2019\nPHY681A QUANTUM FIELD THEORY, Fall 2020\nPHY524A ATOMIC AND MOLECULAR PHYSICS, Spring 2020"
}