{
  "text": "ABHIMANYU JADLI\n+91 7830026156 ⋄ Kotdwar, Uttarakhand\nharshitjadli44@gmail.com ⋄ GitHub ⋄ LinkedIn\nEDUCATION\nBachelor of Engineering July 2019 - June 2023\nComputer Science with Specialization in Artificial Intelligence and Machine Learning\nChandigarh University, Punjab, India\nCumulative Grade Point Average: 8.27/10.00\nCentral Board for Secondary Education (XII) April 2018 - May 2019\nD.A.V Public School, Kotdwar, Uttarakhand, India\nSubjects: Physics, Mathematics, Chemistry, Computer Science, English, Physical Education\nOverall Percentage: 88.2 %\nCentral Board for Secondary Education (X) April 2017 - May 2017\nBlooming Vale Public School, Kotdwar, Uttarakhand, India\nSubjects: Mathematics, Science, Social Science, English, Hindi\nCGPA: 9.2/10\nSKILLS\nTechnical: Python, C/C++, JAVA, Shell Scripting, Lua, Rust, GoLang, MATLAB, LaTeX, AI&ML\nComputer Vision, Natural Language Processing, SQL, Postgres, MongoDB, Redis, Flutter\nSystem Design, AWS, GCP, IoT, MQTT, Embedded Systems, Robot Operating System,\nReal-Time Operating System\nLanguages: Fluent English (IELTS: 7.5), Fluent Hindi, Basic German\nPUBLICATIONS\nCloud Based Surveillance using ESP32 CAM - IEEE XPLORE 03-11-2021\nEarly-Stage Diabetes Risk Prediction: A Comparative Analysis of Classification Algorithms - IARJSET 10-02-2021\nNo Directions (Science-Fiction Novel) 03-12-2018\nWORK EXPERIENCE\nInterax Solutions: Software Engineer and Co-Founder February 2024 - Present\nRemote, Bangalore, India\nInterax is an early-stage Indian startup that aims to develop next-generation peripheral tools for new-age computing\ndevices like Augmented reality and Virtual reality. Rumyx, a software that makes interactions between users and\nmodern computers more seamless, is the company’s first product. Link\n• Designed and developed Python-based platform-agnostic software that interacts with system commands, and\nlaunches applications, URLs, and shell scripts while maintaining security.\n• Developed detailed user activity tracker and multi-device file-sharing system.\n• Developed mobile application using Flutter with BloC and clean architecture to interact with the software on\nthe system using web sockets.\n• Developed backend using FastAPI and Postgres to store user data. Used Twilio for user authentication.\nAlectio: Backend Engineer January 2023 - January 2024\nRemote, Santa Clara, California, United States\nThe Alectio platform is the first full-stack, end-to-end, ML-driven self-serve DataPrepOps platform® enabling ML\nteams to prepare, curate, annotate, manage, version, and visualize their training data in a few clicks, in near-real-time\nand quasi-automated manner.\n• Developed APIs to integrate Alectio SDK and Alectio platform, optimizing the SDK to boost performance by\n40 percent.\n• Developed Flyte workflows for ML processes, labeling, and annotations.\n• Designed and Developed auto labeling tool for text-based datasets.\nTitanium: Software Developer and Co-Founder December 2019 – August 2022\nHybrid, Mohali, Punjab India\nTitanium was a startup by my two seniors and me. We mostly worked on end-to-end development of IoT products\nand used to provide services to other startups or companies. Later, Titanium also focused on building its product\nFlakes, a smart RGB lighting solution. Link\n• Developed backend (Flask) and Mobile Application for IoT-based Customizable RGB lighting systems with sync\nfunctionality to operate multiple devices together.\n• Developed and Deployed Python-based application on Linux VMs using NGINX and Gunicorn.\n• Developed custom Alexa Skills for smart home applications.\n• Designed and developed scalable systems for techno-farming R&D systems (Mobile Application to Backend).\n• Developed a Mobile Application for Fencing Sport (using BLE) as an aid to the devices developed by the\ncompany for pairing with the devices and keeping track of the score as per the mode of the game.\nDS Kothari Centre for Research and Innovation in Science Education July 2020 – August 2020\nSummer Intern\nRemote, Miranda House, University of Delhi, New Delhi, India\nSupervisor : Dr. Mallika Verma and Dr. Monika Tomar\n• Robotics\n• Designed and developed an autonomous retractable helmet with accident detection and prediction system using\nclassical dynamics.\nTEACHING EXPERIENCE\n• Maker Mentor, Electronics & Robotics, IoT, Makers Asylum August 2023 - Present\nOne-to-one interactive hands-on electronics and IoT training sessions with students from diverse backgrounds.\nACHIEVEMENTS\n• Patent, Head Protection Device Link 2024\n• 2nd Position, Samsung’s Sponsored Hackathon 2022\n• 1st Position, Presentation Mathematics Week 2019\nPRESENTATION/TALKS/WORKSHOP\n• Speaker, Workshop on ’Gateway to Python’ Aerospace Department, Chandigarh University 2022\n• Speaker, Workshop on ’A step towards Embedded Systems’ at Miranda House, University of Delhi 2021\n• Speaker, Workshop on ’Basics of Electronics and IoT’ at Miranda House, University of Delhi 2020\nPROJECTS\nSolar Flare Prediction October 2022 - December 2022\n• Developed Python scripts to get data gathered by DSCOVR from NOAA’s website.\n• LSTM-based Neural Network was trained for the prediction.\n• The model output was connected with MQTT to send a trigger as a signal to hypothetical power stations.\nVisio: Object and Face Recognizer for Blinds May 2022 - July 2022\n• The object detection was achieved using the coco dataset trained with YOLO.\n• The face-recognition library was used to recognize faces and the output was sent to ESP32 to play the corresponding WAV file.\nVision based Missile Guiding System August 2021 - October 2022\n• The data set of fighter planes was developed by me and my team member in this project.\n• We have tried and tested the dataset with various image-based models and achieved better accuracy with\nYOLOV5.\n• The locking of objects and returning the path-correcting values to the hardware.\nBooknBooks August 2021 - October 2021\n• An online space for readers to browse books from across the globe and genres while giving users features like\ntheir own shelves.\n• Backend was built using Django.\n• Recommendation engine was based on the user activity.\n• A script was written to create the dataset for the books using library genesis and z-library’s links, automating\nthe entire process.\nCloud-based Surveillance using ESP32 CAM March 2021 - May 2021\n• Embedded system and Neural networks with live stream video for detecting face masks using ESP32 cam module.\n• Cost effective solution ready for deployment.\nColor Sensor based laser detection in sunlight December 2020 - January 2021\n• The color sensor-based laser detection system was built using lenses and mirrors.\n• The final detection was achieved using soft computing techniques like Neural Networks.\nDiabetify December 2020 - February 2021\n• An android application that uses a Neural Network to predict diabetes.\n• Flutter was used to build the Android application.\n• The backend was built using Flask which was deployed on Heroku (PaaS).\nZombied: Text-Based Adventure Game November 2020 - December 2020\n• The game involves various riddles and quizzes to unlock rooms.\n• It also features items and interaction with those items to uplevel in the game.\n• Implemented save game and reload game features.\nRELEVANT COURSEWORK\nBasic Electrical and Electronics Engineering, Calculus and Vector Spaces, Engineering Graphics using CAD Lab,\nBiology for Engineers, Computer Programming using C, Data Structures, Object Oriented Programming using C++,\nDigital Electronics, Discrete Mathematics, Advanced Engineering Physics, Python for machine learning, Operating\nSystem, Programming in JAVA, Database Management Systems, Design and analysis of algorithm, Probability and\nStatistics, Digital Image Processing, Machine Learning, Computer Networks, Computer Organization and Architecture, Advanced Probability and Statistics, Soft Computing, Deep Learning, Advanced Programming ( algorithms),\nAgile Development Methodologies, Enterprise Resource Planning, Computer Vision, Natural Language Processing,\nNetwork Operating Systems, Theory of computation, Mobile Technologies, Data and Visual Analytics in AI, Security and Data Privacy Laws and Standards, Advanced Database Management, Strategy, Business and Globalization,\nEntrepreneurship"
}