{
  "text": "Stitaprajna Panda\n +919348974008 |  stitaprajna.panda@gmail.com |  Stitaprajna |  stitaprajna-panda-b671b4236/\nEducation\nIndian Institute of Technology (IIT), Kanpur MS iN PHYSiCS • CPI: 7.48/10.0\nKanpur, India\nAug. 2018 ‑ Jun. 2021\nExperience\nPlot Potential, Auckland(NZ) Pune, India\nAI/ML ENGiNEER May. 2024 ‑ Present\n• Developed a hybrid Reinforcement Learning (RL) Agent grid‑based algorithm to build 2‑D floor plan of any plot dimensions in Auckland City.\n• Creating Content‑Aware‑Fill (Conditional Latent Diffusion), Classification & Regression models for 2‑D floor plan generation in Auckland City.\n• Developing a Graph Neural Network(GNN) based approach for Contour Regression, enabling the partitioning of the plot into different zones.\n• Restructured and Implemented a Cold‑Start Recommendation System to predict Hot Plots, a proprietary feature of Plot Potential framework.\n• Designed a YOLOv8‑based segmentation model for an accurate driveway detection in the GIS map data, archiving a F1‑score of 95.8%.\n• Built a 2‑Stage‑Classifier (YOLOv8) for detection of regular & irregular shapes, which are either normal or rear lot, with a F1‑score of 96%.\nNearBuzz, Hyderabad Hyderabad, India\nAI ENGiNEER Oct. 2023 ‑ May. 2024\n• Delivered a POC for Chat AI service for a client Finance project on LLMs, implemented using Langchain, RAG, and OpenAI models.\n• Deployed Strapi(Content Management System) through Docker and AWS (Elastic Bean Stalk), to maintain the resources for a client project.\n• Collaborated in client project (Ed‑tech company), contributed to Frontend Development using React, managed entire cloud deployment (AWS).\nAlectio India, Hyderabad Remote\nML RESEARCHER • Planned & enforced modified Expected Model Change (Active Learning) for Machine Translation, reduced training data to 33%.\n• Created Fast Fourier Transform Query Strategy, removed the corrupted data points from image dataset.\n• Pioneered a ‘Phase‑based’ Query Strategy for Time‑Series and applied to a real‑world data.\n• Productionized Greedy Sampling (Active Learning) for Regression pipelines & integrated support for FLYTE.\nFeb. 2023 ‑ Oct. 2023\nDigite Inc., Bengaluru Remote\nDATA SCiENCE INTERN • Hand‑Engineered motion based CV algorithm, detected humans in range 60m, and reduced both FP & FN of the model.\n• Built an Object Detection model and automated the hand drawn Agile‑Board SwiftKanban with a F1‑score of 90%.\n• Custom Trained the Detectron2 ( ResNext‑101), and improved the Recall of the base Key‑Point Detection model by 20%.\nSep. 2022 ‑ Jan. 2023\nChattel Technologies Private Limited, Bengaluru PYTHON DEVELOPMENT INTERN Remote\nJul. 2022 ‑ Sep. 2022\n• Extracted the Option‑Chain data from NSE website, Validated the ‘Trading’ code, and obtained the best parameters through ‘Backtesting’ code.\n• Optimized the F1‑score of Inception v3 Stock‑Market model by 60% and deployed on FastAPI and cloud.\nTechnical skills\nProgramming Language ML Models and Libraries Computer Science and AI Python, Java, JavaScript, Typescript, MySQL, HTML, CSS\nYolo, GPT, LangChain, Scikit, Numpy, Matplotlib, Pandas, OpenCV, PyTorch, TensorFlow, Docker, Kubernates, Gym\nData Structures, Algorithms, OOPs, ML, DL, NLP, Computer Vision, Reinforcement Learning, GNN,GAN, Statistics\nProjects\nAdvanced Traffic Management System \nTRAFFiC ViDEO DATASET\n• Constructed the Speed Tracking Regions and estimated distance between each.\n• Employed YOLOv8, Deep SORT, tracked vehicles and calculated ‘Time Elapsed’ between the regions.\n• Calculated the Average Speed of each vehicle , & displayed the number of vehicles.\n• Compared real‑time speeds of vehicle and the identified vehicles exceeded the speed‑limit (80 km/hr).\n• Custom trained YOLOv8 and found other Traffic violations like no helmet, no seat belt and phone detection.\nAutoML/Machine learning Premium forecasting\nFREELANCiNG PROJECT (UPWORK)\n• Automated the Time‑Series Forecasting for Logistics in Power Bi. Designed a Auto‑Training pipeline, Utilized task scheduler and brought the ‘MAPE’\nunder 5% for predictions of revenue over 100 days. Executed models like TFT & N‑Beats."
}